{"stories":[{"title":"Violence Erupts in Kansas City Chiefs Super Bowl Parade","summary":"During the Kansas City Chiefs Super Bowl victory parade, a tragic shooting occurred resulting in one death and up to 15 people injured, including 4 students wounded in a related incident in Atlanta. Authorities took two armed suspects into custody. Kansas City police and Chiefs players have called for prayers as the community grapples with the aftermath.","category":"Social Issues","location":"United States, Kansas City","info":"\n• [[14] ABC News:  Kansas City police chief says up to 15 people injured after shooting at Chiefs Super Bowl parade](https://abcnews.go.com/US/wireStory/kansas-city-police-chief-15-people-injured-after-107242934)\n\n• [[15] ABC News:  At least one person was killed in a shooting at the end of the Kansas City Chiefs Super Bowl parade, police say](https://abcnews.go.com/US/wireStory/person-killed-shooting-end-kansas-city-chiefs-super-107242923)\n\n• [[88] Fox News: Atlanta high school shooting injures 4 students after dismissal, district says](https://www.foxnews.com/us/atlanta-high-school-shooting-injures-four-students-dismissal-district)\n\n• [[98] Fox News: 1 dead, multiple people injured in shooting near Chiefs' Super Bowl victory rally in Kansas City](https://www.foxnews.com/us/dead-multiple-people-injured-shooting-near-chiefs-super-bowl-victory-rally-kansas-city)\n\n• [[99] Fox News: Patrick Mahomes, Chiefs players call for prayers after shooting erupts at Kansas City Super Bowl parade](https://www.foxnews.com/sports/patrick-mahomes-chiefs-players-call-prayers-shooting-erupts-kansas-city-super-bowl-parade)\n"},{"title":"Special Counsel Urges Supreme Court to Proceed With Trump's 2020 Case","summary":"Special counsel Jack Smith has made a significant move by asking the U.S. Supreme Court to allow Donald Trump's 2020 election interference case to go to trial without further delay. This request underscores the urgency and importance of addressing allegations of election interference in a timely manner.","category":"Politics","location":"United States","info":"\n• [[3] ABC News:  Special counsel asks Supreme Court to let Trump's 2020 election case proceed to trial without delay](https://abcnews.go.com/US/wireStory/special-counsel-asks-supreme-court-trumps-2020-election-107244818)\n\n• [[4] ABC News:  Special counsel Jack Smith urges Supreme Court to let Donald Trump's 2020 election trial proceed without further delay](https://abcnews.go.com/US/wireStory/special-counsel-jack-smith-urges-supreme-court-donald-107244620)\n\n• [[165] Yahoo: Special counsel asks Supreme Court to let Trump's 2020 election case proceed to trial without delay](https://news.yahoo.com/special-counsel-asks-supreme-court-230517585.html)\n\n• [[169] Yahoo: Special counsel urges US Supreme Court to rebuff Trump in immunity fight](https://news.yahoo.com/special-counsel-urges-us-supreme-230151120.html)\n"},{"title":"Israel-Hamas Conflict Intensifies With Attacks and Civilian Casualties","summary":"The ongoing conflict between Israel and Hamas has escalated, with Israel launching extensive strikes in Lebanon and the Gaza Strip, resulting in civilian casualties and widespread destruction. International efforts to establish a cease-fire in Gaza are in jeopardy as violence persists, prompting urgent calls for peace and humanitarian aid.","category":"World News","location":"Middle East","info":"\n• [[1] ABC News:  MIT suspends student group that protested against Israel's military campaign in Gaza](https://abcnews.go.com/US/wireStory/mit-suspends-student-group-protested-israels-military-campaign-107245012)\n\n• [[8] ABC News:  Palestinians living in US will be shielded from deportation, the White House says](https://abcnews.go.com/US/wireStory/palestinians-living-us-shielded-deportation-white-house-107244518)\n\n• [[25] WSJ: Gaza Cease-Fire Talks in Limbo as Israel Sits Out Next Round](https://www.wsj.com/articles/israel-carries-out-extensive-strikes-in-lebanon-48a5a01c)\n\n• [[57] Huffpost: Palestinians Isolated In Major Gaza Hospital Evacuate After Weeks Of Israeli Attacks](https://www.huffpost.com/entry/displaced-palestinians-evacuate-gaza-nasser-hospital_n_65ccf0ece4b0dd11b91172c1)\n\n• [[104] Washington Post: Israel launches strikes on Lebanon; hostage talks in Egypt continue](https://www.washingtonpost.com/world/2024/02/14/israel-hamas-war-news-gaza-palestine/)\n\n• [[105] Washington Post: Biden issues order exempting Palestinians from removal from U.S. for 18 months](https://www.washingtonpost.com)\n\n• [[106] Washington Post: Israeli jets hit Lebanon in heaviest strike since Gaza war began](https://www.washingtonpost.com)\n\n• [[107] Washington Post: Caribbean oil spill blackens beaches, but mystery apparently cleared up](https://www.washingtonpost.com/world/2024/02/14/trinidad-tobago-oil-spill/)\n\n• [[109] Washington Post: Israeli jets hit Lebanon in heaviest strike since Gaza war began](https://www.washingtonpost.com/world/2024/02/14/israel-lebanon-strikes-hezbollah/)\n\n• [[111] Washington Post: Aid groups and world leaders warn against an Israeli offensive on Rafah](https://www.washingtonpost.com)\n\n• [[112] Washington Post: Israeli jets hit Lebanon in heaviest strike since Gaza war began ](https://www.washingtonpost.com)\n\n• [[113] Washington Post: Gaza cease-fire talks in Cairo appear to stall as Rafah offensive looms ](https://www.washingtonpost.com/world/2024/02/14/israel-gaza-hamas-cairo-talks-khan-younis/)\n\n• [[114] Washington Post: Teacher sued over accusations he tried to sell junior high students’ art](https://www.washingtonpost.com)\n\n• [[115] Washington Post: Gaza cease-fire talks in Cairo appear to stall as Rafah offensive looms](https://www.washingtonpost.com)\n\n• [[123] Washington Post: Israel orders evacuations from Nasser Hospital in southern Gaza](https://www.washingtonpost.com)\n"},{"title":"Tech Layoffs Signal Industry Downturn","summary":"Cisco Systems has announced layoffs of over 4,000 employees, and tech giant Amazon's founder, Jeff Bezos, has sold shares worth over $4 billion, highlighting a trend of job cuts and financial reshuffling in the technology sector amid market pressures and economic uncertainties.","category":"Finance & Economy","location":"Global","info":"\n• [[7] ABC News:  Cisco Systems to lay off more than 4,000 workers in latest sign of tighter times in tech](https://abcnews.go.com/US/wireStory/cisco-systems-lay-off-4000-workers-latest-sign-107244517)\n\n• [[26] WSJ: Cisco to Cut 5% of Workforce Amid Restructuring Efforts](https://www.wsj.com/articles/cisco-to-cut-5-of-workforce-amid-restructuring-efforts-abf84b57)\n\n• [[53] BBC: Amazon founder Jeff Bezos sells shares worth over $4bn](https://www.bbc.co.uk/news/business-68277678?at_medium=RSS&at_campaign=KARANGA)\n"},{"title":"Biden Allies and Rivals Demand Transparency Over Special Counsel Interview","summary":"Both allies and rivals of President Joe Biden are calling for the release of the transcript from his special counsel interview, concerning his handling of classified documents. The situation reveals a bipartisan interest in transparency and accountability at the highest levels of government.","category":"Politics","location":"United States","info":"\n• [[9] ABC News:  Biden allies, rivals both want transcript of his special counsel interview released. It could happen](https://abcnews.go.com/US/wireStory/biden-allies-rivals-transcript-special-counsel-interview-released-107243918)\n"},{"title":"Dangers on the Rise: Threats to Federal Judges and Drive-By Shootings","summary":"The US Marshals director reports an alarming spike in threats to federal judges, doubling in three years. Additionally, four students were wounded in a drive-by shooting outside an Atlanta high school, highlighting an increase in violence and harassment aimed at public officials and communities.","category":"Social Issues","location":"United States","info":"\n• [[5] ABC News:  Four students were wounded in a drive-by shooting outside an Atlanta high school, officials say](https://abcnews.go.com/US/wireStory/students-wounded-drive-shooting-atlanta-high-school-officials-107244622)\n\n• [[10] ABC News:  Threats to federal judges have more than doubled in 'alarming' spike, US Marshals director says](https://abcnews.go.com/US/wireStory/threats-federal-judges-doubled-alarming-spike-us-marshals-107243506)\n"},{"title":"Student Protests and Suspension at MIT Over Israel Campaign","summary":"The Massachusetts Institute of Technology (MIT) has suspended a student group following their protests against Israel's military campaign in Gaza, sparking a debate about free speech and activism on college campuses in the context of international conflict.","category":"Social Issues","location":"United States, Massachusetts","info":"\n• [[1] ABC News:  MIT suspends student group that protested against Israel's military campaign in Gaza](https://abcnews.go.com/US/wireStory/mit-suspends-student-group-protested-israels-military-campaign-107245012)\n"},{"title":"Global Romance Scams Result in Major Financial Losses","summary":"The Federal Trade Commission reports over 64,000 cases of romance scams in the last year, totaling $1.14 billion in losses. This highlights the growing menace of online fraud exploiting individuals seeking romantic connections, with scammers employing manipulative tactics to siphon money.","category":"Social Issues","location":"Global","info":"\n• [[19] ABC News:  How to keep yourself safe from romance scams this Valentine's Day](https://abcnews.go.com/US/wireStory/safe-romance-scams-valentines-day-107241485)\n"},{"title":"Climate Activists Protest by Dumping Red Powder on U.S. Constitution Enclosure","summary":"Activists dumped red powder on the enclosure protecting the U.S. Constitution at the National Archives, prompting an evacuation. This act of protest highlights the increasing use of dramatic tactics by climate activists to draw attention to environmental and political issues.","category":"Environment","location":"United States","info":"\n• [[16] ABC News:  Protesters pour red powder on US Constitution enclosure, prompting evacuation of National Archives](https://abcnews.go.com/US/wireStory/protestors-pour-red-powder-us-constitution-enclosure-prompting-107243024)\n\n• [[96] Fox News: National Archives Rotunda evacuated after climate activists dump pink powder on case holding US Constitution](https://www.foxnews.com/us/national-archives-rotunda-evacuated-climate-activists-dump-pink-powder-case-holding-us-constitution)\n"},{"title":"Migrant Crossings at the US-Mexico Border Decline","summary":"The recent decrease in arrests for illegal crossings at the U.S.-Mexico border signals a temporary shift in migration trends. This comes amid broader discussions on immigration policy and border security in the United States.","category":"World News","location":"United States","info":"\n• [[2] ABC News:  Migrant crossings at the US-Mexico border are down. What's behind the drop?](https://abcnews.go.com/US/wireStory/migrant-crossings-us-mexico-border-drop-107245011)\n"},{"title":"Row Over MIT Suspension of Student Group Protesting Israel's Military Actions","summary":"MIT faces criticism after suspending a student group protesting Israel's military operations in Gaza. The move has sparked debates about academic freedom and the role of educational institutions in political and social issues.","category":"Social Issues","location":"United States","info":"\n• [[1] ABC News:  MIT suspends student group that protested against Israel's military campaign in Gaza](https://abcnews.go.com/US/wireStory/mit-suspends-student-group-protested-israels-military-campaign-107245012)\n"},{"title":"Concerns Raised Over Treatment of Palestinians in the US","summary":"The White House announces protection from deportation for Palestinians living in the U.S., citing deteriorated conditions in Gaza amid ongoing conflict. This move highlights the U.S. government's stance on humanitarian issues and its effort to support individuals affected by international crises.","category":"World News","location":"United States","info":"\n• [[8] ABC News:  Palestinians living in US will be shielded from deportation, the White House says](https://abcnews.go.com/US/wireStory/palestinians-living-us-shielded-deportation-white-house-107244518)\n"}]}