{"stories":[{"title":"Supreme Court to Decide on Trump's 2024 Ballot Presence","location":["USA"],"category":"Politics","articles":[{"id":"https://abcnews.go.com/US/wireStory/supreme-court-decision-monday-case-barring-trump-2024-107756943","title":" A Supreme Court decision could come Monday in a case about barring Trump from the 2024 ballot","summary":"A Supreme Court decision could come as soon as Monday in the case about whether former President Donald Trump can be kicked off the ballot over his efforts to undo his defeat in the 2020 election","published":"2024-03-03T19:58:29.000Z","author":"ABC News"},{"id":"https://www.foxnews.com/politics/supreme-court-decision-case-barring-trump-colorados-2024-ballot-could-arrive-monday","title":"Supreme Court decision on case barring Trump from Colorado's 2024 ballot could arrive as early as Monday","summary":"The Supreme Court’s decision in a case that will determine whether former President Trump can be kicked off Colorado’s state primary ballot could arrive as early as Monday.","published":"2024-03-03T22:44:15.000Z","author":"Fox News"}],"summary":"The United States Supreme Court is set to make a pivotal decision that could determine whether former President Donald Trump will be eligible to appear on the 2024 ballot. This much-anticipated verdict, possibly arriving as early as Monday, is the culmination of intense legal debates concerning Trump's actions following his 2020 election loss. Central to the case is whether Trump's efforts to contest his defeat disqualify him from seeking office again. \n\nThe legal challenge, originating in Colorado, questions if Trump can be barred from the state's primary ballot, setting a precedent that could have nationwide implications. This high-stakes matter has garnered significant attention, highlighting the ongoing political and legal ramifications of the 2020 election aftermath. Both ABC News and Fox News have reported on the impending decision, signaling the importance of the Supreme Court's ruling in shaping the future of American electoral politics. The country awaits the Court's judgment, which will not only impact Trump's political career but also set a critical legal precedent regarding the eligibility requirements for presidential candidates."},{"title":"Gaza and Israel Approach Possible Ramadan Cease-fire Amidst Crisis","location":["Gaza","Israel"],"category":"World News","articles":[{"id":"https://www.wsj.com/articles/hopes-for-gaza-truce-grow-as-hamas-joins-talks-in-cairo-e413cf3f","title":"Negotiators Say Gaza Truce Could Be Near, but Obstacles Remain","summary":"Hamas and Israel are making slow progress and could strike an agreement before Ramadan, Egyptian officials said.","published":"2024-03-03T23:09:00.000Z","author":"WSJ"},{"id":"https://www.wsj.com/articles/playing-hamass-game-on-aid-to-gaza-israel-war-middle-east-f7f24d13","title":"Playing Hamas's Game on Aid to Gaza","summary":"Israel has been set up to take the blame. Biden goes along with it.","published":"2024-03-03T21:54:00.000Z","author":"WSJ"},{"id":"https://www.nytimes.com/2024/03/03/world/middleeast/israel-aid-gaza-convoy.html","title":"Lack of Plan for Governing Gaza Formed Backdrop to Deadly Convoy Chaos","summary":"Israel has no clear plan for governing Gaza. That is a particular problem in the north, where the fighting has ebbed, and where a deadly stampede occurred on Thursday around an aid convoy.","published":"2024-03-03T17:01:06.000Z","author":"New York Times"},{"id":"https://www.washingtonpost.com","title":"How Israel’s restrictions on aid put Gaza on the brink of famine      ","summary":"Aid groups say bureaucratic obstacles, onerous Israeli inspections and military attacks on police and humanitarian convoys have created a “manmade” hunger crisis. \n","published":"2024-03-03T23:01:24.000Z","author":"Washington Post"},{"id":"https://www.washingtonpost.com","title":"U.S. plans more airdrops into Gaza amid hope for Ramadan cease-fire","summary":"Some aid groups say airdrops are expensive and insufficient to address the enormous need in Gaza, where hunger has forced people to eat weeds and animal feed.","published":"2024-03-03T21:16:37.000Z","author":"Washington Post"},{"id":"https://www.latimes.com/california/story/2024-03-02/thousands-of-pro-palestinians-protesters-march-in-downtown-los-angeles-calling-for-cease-fire-in-gaza","title":"Thousands of protesters march in downtown Los Angeles calling for cease-fire in Gaza","summary":"<p>The march and rally were part of pro-Palestinian demonstrations held across the country and around the world on Saturday. </p>","published":"2024-03-03T02:24:59.000Z","author":"LA Times"}],"summary":"**Gaza-Israel Cease-fire Hopes Rise as Ramadan Nears Despite Challenges**\n\nAs Ramadan approaches, the international community is watching closely as Israel and Hamas edge towards a potential cease-fire agreement. Intense negotiations, most notably in Cairo with the involvement of Egyptian officials, indicate progress, albeit slow, towards halting the conflict that has gripped the region.\n\nRecent reports highlight the complexities underlying the situation. Among the primary issues is the management of aid to Gaza, a matter that has grown increasingly contentious. Accusations have flown from both sides, with Israel being criticized for its stringent control over aid, creating significant obstacles for humanitarian efforts. The lack of a clear strategy for governing Gaza, especially in its northern regions where recent fighting has somewhat subsided, has only exacerbated the challenges facing aid distribution and the overall stability of the area.\n\nThe situation reached a critical point with a deadly incident involving an aid convoy, spotlighting the severe impact of these administrative and security hurdles. Moreover, aid organizations have condemned the bureaucratic and military barriers they face, which have precipitated a dire hunger crisis within Gaza. Desperate conditions have pushed residents to rely on weeds and animal feed for sustenance, a stark indicator of the severity of the humanitarian issue at hand.\n\nIn response to the escalating crisis, the U.S. has announced plans to increase airdrops of aid into Gaza, aiming to alleviate the immediate needs. However, this approach has faced criticism from some aid groups, who argue that such measures are both costly and insufficient to address the extensive needs of the Gaza population.\n\nPublic sentiment, both nationally and internationally, is increasingly in favor of a cease-fire, as demonstrated by thousands of pro-Palestinian protesters marching in downtown Los Angeles and other cities around the globe. These demonstrations reflect a growing call for peace and humanitarian relief in the region.\n\nAs negotiators work against the clock to forge a cease-fire ahead of the holy month of Ramadan, the world hopes for a resolution that will bring an end to the violence and lead to a sustainable solution for peace and the well-being of all individuals affected by the conflict in Gaza."},{"title":"Shehbaz Sharif Elected as Pakistan's Prime Minister Amid Controversy","location":["Pakistan"],"category":"Politics","articles":[{"id":"https://abcnews.go.com/US/wireStory/lawmakers-elect-shehbaz-sharif-pakistans-new-prime-minister-107751941","title":" Lawmakers elect Shehbaz Sharif as Pakistan's new prime minister. Shouts and protests in parliament greet his appointment","summary":"Lawmakers elect Shehbaz Sharif as Pakistan's new prime minister. Shouts and protests in parliament greet his appointment","published":"2024-03-03T11:49:46.000Z","author":"ABC News"},{"id":"https://www.huffpost.com/entry/pakistan-new-prime-minister-shehbaz-sharif_n_65e4771be4b013678e15a6b7","title":"Shehbaz Sharif Becomes Pakistan's New Prime Minister","summary":"Allies of imprisoned former premier Imran Khan in parliament shouted in protest, alleging rigging in last month’s election.","published":"2024-03-03T13:19:04.000Z","author":"Huffpost"},{"id":"https://www.washingtonpost.com","title":"Lawmakers pick Pakistan’s leader, but Khan’s shadow looms from prison","summary":"Shehbaz Sharif’s election comes after months of turmoil. His party has no absolute majority and faces fraud allegations from former leader Imran Khan’s allies.","published":"2024-03-03T20:07:55.000Z","author":"Washington Post"},{"id":"https://www.washingtonpost.com/world/2024/03/03/pakistan-shehbaz-sharif-prime-minister/","title":"Lawmakers pick Pakistan’s leader, but Khan’s shadow looms from prison","summary":"Shehbaz Sharif’s election comes after months of turmoil. His party has no absolute majority and faces fraud allegations from former leader Imran Khan’s allies.","published":"2024-03-03T11:39:41.000Z","author":"Washington Post"},{"id":"https://www.latimes.com/world-nation/story/2024-03-03/shehbaz-sharif-becomes-pakistans-new-premier-as-imran-khans-allies-in-parliament-allege-rigging","title":"Shehbaz Sharif becomes Pakistan's premier as opponents in parliament allege rigging","summary":"<p>After days of negotiations, lawmakers in Pakistan's National Assembly elect Shehbaz Sharif as prime minister for the second time.</p>","published":"2024-03-03T16:21:10.000Z","author":"LA Times"}],"summary":"In a contentious political atmosphere marked by shouts and protests, Shehbaz Sharif ascended to the role of Pakistan's Prime Minister, following a parliamentary election filled with controversy. Elected amid fervent opposition and allegations of electoral rigging, Sharif's victory spotlights the ongoing political strife within the nation. The election, preceded by months of instability and legal challenges, underscores the profound divisions and the difficult road ahead for Sharif's administration. \n\nDespite winning the parliamentary vote, Sharif's party does not hold an absolute majority, which complicates the political landscape even further. The stark opposition was vividly displayed as allies of the imprisoned former Prime Minister Imran Khan vocally protested during the election, accusing Sharif's victory of being marred by electoral fraud. These allegations of rigging, fervently posited by Khan's supporters, cast a shadow over the legitimacy of the election results and Sharif's ensuing tenure.\n\nSharif's succession to prime minister comes at a tumultuous time for Pakistan, with the nation grappling with economic woes and seeking stability in its democratic processes. The events leading to his election were fraught with tension, reflecting the broader discord among Pakistan's political factions. As Sharif embarks on his term, the challenges ahead include not only addressing the allegations and skepticism from his opponents but also navigating the intricate issues facing Pakistan on both domestic and international fronts.\n\nObservers highlight that the dramatic scenes in parliament during Sharif's election are indicative of the polarized political climate in Pakistan. Sharif's ability to consolidate support and steer the nation towards unity and development remains to be seen amid the lingering specter of Imran Khan's controversial legacy and the persistent doubts cast by his supporters.\n\nAs Pakistan moves forward under Shehbaz Sharif's premiership, the international community and Pakistani citizens alike watch closely, hopeful for a path that leads to reconciliation and progress, while wary of the deep-seated political rivalries that have characterized the country's recent history."},{"title":"Iowa's Caitlin Clark Breaks NCAA Scoring Record","location":["USA"],"category":"Sports","articles":[{"id":"https://abcnews.go.com/US/wireStory/caitlin-clark-iowa-passes-late-pete-maravich-time-107757139","title":" Caitlin Clark of Iowa passes the late Pete Maravich as the all-time NCAA Division I scorer with her 3,668th point","summary":"Caitlin Clark of Iowa passes the late Pete Maravich as the all-time NCAA Division I scorer with her 3,668th point","published":"2024-03-03T19:41:49.000Z","author":"ABC News"},{"id":"https://www.foxnews.com/sports/iowas-caitlin-clark-reflects-breaking-ncaa-scoring-record","title":"Iowa's Caitlin Clark reflects after breaking NCAA scoring record: 'Very grateful'","summary":"Iowa&apos;s Caitlin Clark has much to reflect on after not just playing her final regular-season home game on Sunday, but also setting the Division I college basketball scoring record.","published":"2024-03-03T22:03:45.000Z","author":"Fox News"},{"id":"https://www.foxnews.com/sports/iowas-caitlin-clark-surpasses-pete-maravich-ncaa-scoring-record","title":"Iowa's Caitlin Clark surpasses Pete Maravich for NCAA scoring record","summary":"Iowa sharpshooter Caitlin Clark surpasses Pete Maravich for the all-time NCAA scoring record against Ohio State on Sunday. It was Clark&apos;s final home game.","published":"2024-03-03T19:18:37.000Z","author":"Fox News"}],"summary":"In an electrifying display of skill and determination, Iowa's own Caitlin Clark shattered the NCAA Division I scoring record, previously held by the legendary Pete Maravich. Clark, in a game that will be remembered for years to come, tallied her 3,668th point, catapulting her past Maravich's longstanding record. This incredible achievement came during what was her final regular-season home game against Ohio State.\n\nClark's journey to becoming the all-time NCAA Division I scorer is one marked by sheer dedication, immense talent, and a work ethic that is second to none. Her remarkable feat has not only etched her name in the annals of college basketball history but has also resonated with fans, aspiring athletes, and veterans of the sport alike. Reflecting on her milestone, Clark expressed her gratitude, acknowledging the support of her teammates, coaches, and the University of Iowa community. 'Very grateful,' she said, encapsulating the humility that has endeared her to so many.\n\nThe game against Ohio State was nothing short of a cinematic climax for Clark's regular-season college career. With each point scored, the anticipation grew, culminating in the moment she surpassed Maravich, an icon whose record had stood unchallenged for decades. This achievement is not merely about breaking a record; it's a testament to Clark's relentless pursuit of excellence and her unwavering commitment to the game of basketball.\n\nCaitlin Clark's journey and her breaking of the NCAA scoring record is a monumental milestone that transcends sports. It underscores the evolution of women's basketball and serves as an inspiration to countless young athletes. As the news of her unparalleled accomplishment spreads, Clark remains focused, grateful, and poised to continue making history. Her legacy, now firmly established, will undoubtedly inspire future generations to dream big, work hard, and achieve their own greatness in the world of sports and beyond."},{"title":"Congressional Leaders Seek to Avoid Shutdown with Spending Bills","location":["USA"],"category":"Politics","articles":[{"id":"https://abcnews.go.com/US/wireStory/congressional-leaders-6-spending-bills-drive-avoid-partial-107759176","title":" Congressional leaders come out with 6 spending bills in a drive to avoid a partial shutdown","summary":"Congressional leaders have come out with a package of six bills setting full-year spending levels for some federal agencies","published":"2024-03-03T23:34:31.000Z","author":"ABC News"},{"id":"https://www.foxnews.com/politics/congressional-leaders-unveil-bill-fund-government-johnson-schumer-both-claim-wins","title":"Congressional leaders unveil bill to fund government, Johnson and Schumer both claim wins","summary":"Congressional leaders released bill text for the first six appropriations bills they plan to pass to fund the federal government for the rest of fiscal year 2024.","published":"2024-03-03T21:05:57.000Z","author":"Fox News"}],"summary":"In an effort to avert a potential government shutdown, congressional leaders have unveiled a comprehensive package consisting of six spending bills. Aimed at establishing full-year funding levels for various federal agencies, this strategic move marks a critical step towards ensuring the continued operation of the government for the remainder of the fiscal year 2024.\n\nThe package was introduced on March 3, 2024, reflecting a bipartisan effort to navigate the complexities of government funding. Both Senate Majority Leader Schumer and Speaker Johnson have hailed the development as a significant achievement, each underscoring the bipartisan victories embedded within the bills. The bills cover a wide array of federal operations, although specific details regarding the agencies and programs targeted for funding have not been disclosed.\n\nThis development comes at a pivotal moment, with the threat of a partial government shutdown looming over ongoing political deliberations. The introduction of these six appropriations bills is seen as a vital measure to safeguard against the destabilizing impacts of a shutdown, ensuring that essential services and operations continue without interruption.\n\nAnalysts view this bipartisan agreement as a positive sign of possible cooperation in Congress, especially amidst the typically fraught process of negotiating government funding. However, the path ahead remains uncertain, with the proposed package still requiring approval from both chambers of Congress before it can be enacted into law.\n\nAs the bills advance through the legislative process, their progress will be closely monitored by stakeholders across the political spectrum. The outcome of these efforts will not only determine the immediate future of federal operations but also set a precedent for bipartisan collaboration in addressing the nation's pressing fiscal challenges."},{"title":"Aid Challenges and Potential Environmental Disaster in Conflict Zones","location":["Houthi","Yemen"],"category":"Environment","articles":[{"id":"https://www.washingtonpost.com","title":"Fears of environmental disaster rise as ship sinks after Houthi attack","summary":"Cargo ship Rubymar was carrying 21,000 tons of fertilizer when it sank in the Red Sea, Central Command said. The Houthis hit it with a missile in February.","published":"2024-03-03T20:30:08.000Z","author":"Washington Post"},{"id":"https://www.washingtonpost.com/world/2024/03/03/rubymar-houthi-attack-red-sea/","title":"Fears of environmental disaster rise as ship sinks after Houthi attack","summary":"The Rubymar cargo ship was carrying 21,000 metric tons of fertilizer when it sank in the Red Sea, Central Command said. The Houthis hit it with a missile in February.","published":"2024-03-03T17:11:11.000Z","author":"Washington Post"}],"summary":"Title: Aid Challenges and Potential Environmental Disaster in Conflict Zones: The Sinking of Rubymar\n\nIn the Red Sea, a precarious situation unfolds as the cargo ship Rubymar, loaded with 21,000 metric tons of fertilizer, was reported sunk following a Houthi missile attack in February. The escalating fears around this incident point toward a potential environmental disaster, casting a shadow over the already tense atmosphere in conflict-affected zones.\n\nThe Rubymar, laden with a substantial quantity of fertilizer, presents an ominous threat to marine life and the broader environmental health of the Red Sea region. The Central Command's acknowledgment of the incident has sparked concerns among environmentalists and authorities alike, given the potentially catastrophic impact of such a spill. Fertilizers, containing high levels of nitrogen and phosphorus, can lead to algal blooms when released into marine environments. These blooms deplete oxygen in the water, endangering fish and other marine species—a phenomenon known as hypoxia.\n\nThe incident further highlights the challenges faced in delivering aid and managing environmental hazards in areas plagued by conflicts. The Red Sea, a critical maritime route for international trade, now stands at the brink of an ecological crisis, amplifying the urgency for international intervention.\n\nEfforts to address the aftermath of the Rubymar sinking are complicated by the ongoing conflict in the region, raising questions about how to efficiently mitigate the environmental damage while ensuring the safety of humanitarian aid workers and local communities.\n\nAs the world watches the situation unfold, the need for a collaborative approach to prevent such incidents and safeguard vulnerable ecosystems in conflict zones has never been more evident. The sinking of the Rubymar serves as a stark reminder of the intricate links between environmental health and regional stability, urging immediate action to avert a disaster of unprecedented scale."},{"title":"Escalating Crisis as Armed Gangs Free Prisoners in Haiti","location":["Haiti"],"category":"World News","articles":[{"id":"https://www.foxnews.com/world/armed-gangs-jailbreak-4000-inmates-haiti-days-long-gun-battle-police","title":"Armed gangs jailbreak 4,000 inmates in Haiti after days-long gun battle with police","summary":"Armed gangs stormed Haiti&apos;s largest prison on Saturday, jailbreaking nearly 4,000 inmates as the prime minister pleaded for help with gang violence.","published":"2024-03-03T19:21:43.000Z","author":"Fox News"},{"id":"https://www.yahoo.com/news/hundreds-inmates-flee-armed-gangs-153943719.html","title":"Hundreds of inmates flee after armed gangs storm Haiti's main prison, leaving bodies behind","published":"2024-03-03T15:39:43.000Z","author":"Yahoo"}],"summary":"**Title: Massive Jailbreak in Haiti as Armed Gangs Overpower Police Forces**\\n\nIn a daring and violent display of power, armed gangs in Haiti orchestrated a massive jailbreak, resulting in the escape of nearly 4,000 inmates from the country's largest prison. The incident, occurring on Saturday, has sent shockwaves through Haiti and the international community alike, highlighting the escalating crisis of gang violence that has gripped the nation.\\n\nAccording to reports, the jailbreak was the climax of days-long gun battles between the armed groups and police forces. Haiti's prime minister, in a plea for international assistance, underscored the dire situation, emphasizing the increasing stronghold of gang violence on the country.\\n\nEyewitnesses described scenes of chaos as the armed gangs stormed the prison facilities, leading to the escape of hundreds of inmates. The confrontation left several bodies in its wake, a grim testament to the ferocity of the exchange between the gangs and law enforcement.\\n\nThe incident has drawn attention to the challenges facing Haiti's police and judicial system, already stretched thin and struggling to combat the rising wave of gang-related violence. The jailbreak not only represents a significant breach of security but also raises fears over the potential increase in violence and criminal activities with the sudden influx of fugitives back into society.\\n\nAs the community reels from the incident, the call for help from Haiti's prime minister underscores the urgent need for both national and international response to address the deep-rooted issues of gang dominance and violence. The situation in Haiti remains tense, with authorities mobilizing to recapture the escaped inmates and restore order, while grappling with the broader challenge of ensuring safety and security in a country increasingly under the shadow of gang warfare."},{"title":"Nationwide Protests Call for Immediate Cease-fire in Gaza","location":["USA","Gaza"],"category":"Social Issues","articles":[{"id":"https://www.latimes.com/california/story/2024-03-02/thousands-of-pro-palestinians-protesters-march-in-downtown-los-angeles-calling-for-cease-fire-in-gaza","title":"Thousands of protesters march in downtown Los Angeles calling for cease-fire in Gaza","summary":"<p>The march and rally were part of pro-Palestinian demonstrations held across the country and around the world on Saturday. </p>","published":"2024-03-03T02:24:59.000Z","author":"LA Times"}],"summary":"In a powerful display of solidarity and a demand for peace, thousands of protesters took to the streets in downtown Los Angeles, advocating for an immediate cease-fire in Gaza. This significant demonstration, held on a Saturday, was not isolated to Los Angeles but resonated across the United States and even around the globe, marking a united front against the ongoing conflict in Gaza. The marchers, rallying behind pro-Palestinian sentiments, showcased the rising concern and urgent call for an end to hostilities that have affected countless lives. This mass mobilization underscores a widespread desire for peace and a resolution to a conflict that has long plagued the region, echoing a collective plea for humanitarian relief and a stable future for Gaza."},{"title":"Artistic Tributes and Remembrances in Entertainment Industry","location":["USA"],"category":"Entertainment & Culture","articles":[{"id":"https://abcnews.go.com/US/wireStory/fans-gather-goodbye-flaco-owl-new-york-city-107757335","title":" Fans gather to say goodbye to Flaco the owl in New York City memorial","summary":"Mournful fans of Flaco the Eurasion eagle-owl have gathered in New York City to say goodbye to the beloved celebrity creature who became an inspiration and joy to many as he flew around Manhattan after he was let out of his zoo enclosure","published":"2024-03-03T23:34:30.000Z","author":"ABC News"},{"id":"https://www.foxnews.com/entertainment/blue-bloods-honors-treat-williams-farewell-late-actors-character","title":"'Blue Bloods' honors Treat Williams with farewell to late actor's character","summary":"Treat Williams was honored by &quot;Blue Bloods&quot; detective series in final episode for his character, Lenny Ross. Williams was killed in a motorcycle crash in June.","published":"2024-03-03T22:06:05.000Z","author":"Fox News"},{"id":"https://www.foxnews.com/entertainment/star-wars-gremlins-voice-actor-mark-dodson-dead-64","title":"'Star Wars' and 'Gremlins' voice actor Mark Dodson dead at 64","summary":"&quot;Star Wars&quot; and &quot;Gremlins&quot; voice actor Mark Dodson has died at age 64, a representative for the actor confirmed to Fox News Digital.","published":"2024-03-03T19:36:25.000Z","author":"Fox News"}],"summary":"In a series of emotional tributes that spanned the breadth of the entertainment industry, mourners have come together both in person and through beloved television shows to remember and celebrate figures that have left an indelible mark on their fans and on the industry. From the animal kingdom to the realms of science fiction and law enforcement drama, these commemorations underline the profound ways in which the subjects of these tributes have influenced and been cherished by their audiences.\\n\\nIn New York City, a heartfelt memorial was held for Flaco, the Eurasian eagle-owl, who captured the hearts of many after his escape from captivity allowed him to soar freely around Manhattan. The gathering of Flaco's fans, mourning the loss of the avian celebrity, underscored the unexpected ways in which animals can come to symbolize freedom, resilience, and joy for people.\\n\\nMeanwhile, the world of scripted television provided its own form of homage. The long-running detective series \"Blue Bloods\" paid tribute to the late Treat Williams, an actor beloved for his role as Lenny Ross on the show. Following Williams' tragic death in a motorcycle accident in June, the series crafted a farewell episode for his character, blending narrative closure with real-world grief and respect for the actor’s contributions to the show over the years.\\n\\nThe entertainment industry also mourned the loss of Mark Dodson, a talented voice actor whose work lent life to characters in iconic franchises such as \"Star Wars\" and \"Gremlins.\" Dodson, who died at the age of 64, was remembered for his distinctive contributions to the vocal landscapes of these beloved stories, leaving behind a legacy that will continue to enchant and engage fans of these series.\\n\\nThese tributes, while marking the passing of their subjects, also serve to remind audiences of the deep connections that can be forged between viewers, creators, and even the creatures that entertain and inspire us. In their collective grief and remembrance, fans and colleagues alike acknowledge the lasting impact of those being honored, celebrating the memories and legacies left behind."}]}